qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_rcc.h
/** @defgroup RCC_PLL_Configuration RCC PLL Configuration
  * @{   
  */ 
    
/** @brief  Macro to enable or disable the PLL.
  * @note   After enabling the PLL, the application software should wait on
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  * @note   The PLL can not be disabled if it is used as system clock source
  * @note   The PLL is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __HAL_RCC_PLL_ENABLE()  SET_BIT(RCC->CR, RCC_CR_PLLON)
#define __HAL_RCC_PLL_DISABLE() CLEAR_BIT(RCC->CR, RCC_CR_PLLON)

/** @brief  Macro to configure the PLL clock source, multiplication and division factors.
  * @note   This macro must be used only when the PLL is disabled.
  *
  * @param  __RCC_PLLSource__: specifies the PLL entry clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_PLLSOURCE_HSI: HSI oscillator clock selected as PLL clock entry
  *            @arg RCC_PLLSOURCE_HSE: HSE oscillator clock selected as PLL clock entry
  * @param  __PREDIV__: specifies the predivider factor for PLL VCO input clock
  *         This parameter must be a number between RCC_PREDIV_DIV1 and RCC_PREDIV_DIV16.
  * @param  __PLLMUL__: specifies the multiplication factor for PLL VCO input clock
  *         This parameter must be a number between RCC_PLL_MUL2 and RCC_PLL_MUL16.
  *
  */
#define __HAL_RCC_PLL_CONFIG(__RCC_PLLSource__ , __PREDIV__, __PLLMUL__) \
                  do { \
                    MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PREDIV, (__PREDIV__)); \
                    MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLMUL | RCC_CFGR_PLLSRC, (uint32_t)((__PLLMUL__)|(__RCC_PLLSource__))); \
                  } while(0)
/**
  * @}
  */                      

/** @defgroup RCC_Get_Clock_source RCC Get Clock source
  * @{   
  */ 
  
/** @brief  Macro to get the clock source used as system clock.
  * @retval The clock source used as system clock.
  *         The returned value can be one of the following value:
  *             @arg RCC_SYSCLKSOURCE_STATUS_HSI: HSI used as system clock
  *             @arg RCC_SYSCLKSOURCE_STATUS_HSE: HSE used as system clock
  *             @arg RCC_SYSCLKSOURCE_STATUS_PLLCLK: PLL used as system clock
  */
#define __HAL_RCC_GET_SYSCLK_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SWS)))

/** @brief  Macro to get the oscillator used as PLL clock source.
  * @retval The oscillator used as PLL clock source. The returned value can be one
  *         of the following:
  *              - RCC_PLLSOURCE_HSI: HSI oscillator is used as PLL clock source.
  *              - RCC_PLLSOURCE_HSE: HSE oscillator is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL_OSCSOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PLLSRC)))
/**
  * @}
  */ 

/** @defgroup RCC_Flags_Interrupts_Management RCC Flags Interrupts Management
  * @brief macros to manage the specified RCC Flags and interrupts.
  * @{
  */

/** @brief  Enable RCC interrupt (Perform Byte access to RCC_CIR[12:8] bits to enable
  *         the selected interrupts.).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt enable
  *            @arg RCC_IT_LSERDY: LSE ready interrupt enable
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt enable
  *            @arg RCC_IT_HSERDY: HSE ready interrupt enable
  *            @arg RCC_IT_PLLRDY: PLL ready interrupt enable
  *            @arg RCC_IT_HSI14RDY: HSI14 ready interrupt enable
  *            @arg RCC_IT_HSI48RDY: HSI48 ready interrupt enable (only applicable to STM32F0X2 USB devices)
  */
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) (*(__IO uint8_t *)RCC_CIR_BYTE1_ADDRESS |= (__INTERRUPT__))

/** @brief  Disable RCC interrupt (Perform Byte access to RCC_CIR[12:8] bits to disable
  *         the selected interrupts.).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt enable
  *            @arg RCC_IT_LSERDY: LSE ready interrupt enable
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt enable
  *            @arg RCC_IT_HSERDY: HSE ready interrupt enable
  *            @arg RCC_IT_PLLRDY: PLL ready interrupt enable
  *            @arg RCC_IT_HSI14RDY: HSI14 ready interrupt enable
  *            @arg RCC_IT_HSI48RDY: HSI48 ready interrupt enable (only applicable to STM32F0X2 USB devices)
  */
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) (*(__IO uint8_t *)RCC_CIR_BYTE1_ADDRESS &= ~(__INTERRUPT__))

/** @brief  Clear the RCC's interrupt pending bits ( Perform Byte access to RCC_CIR[23:16]
  *         bits to clear the selected interrupt pending bits.
  * @param  __IT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt clear
  *            @arg RCC_IT_LSERDY: LSE ready interrupt clear
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt clear
  *            @arg RCC_IT_HSERDY: HSE ready interrupt clear
  *            @arg RCC_IT_PLLRDY: PLL ready interrupt clear
  *            @arg RCC_IT_HSI14RDY: HSI14 ready interrupt clear
  *            @arg RCC_IT_HSI48RDY: HSI48 ready interrupt clear (only applicable to STM32F0X2 USB devices)
  *            @arg RCC_IT_CSS: Clock Security System interrupt clear
  */
#define __HAL_RCC_CLEAR_IT(__IT__) (*(__IO uint8_t *)RCC_CIR_BYTE2_ADDRESS = (__IT__))

/** @brief  Check the RCC's interrupt has occurred or not.
  * @param  __IT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt flag
  *            @arg RCC_IT_LSERDY: LSE ready interrupt flag
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt flag
  *            @arg RCC_IT_HSERDY: HSE ready interrupt flag
  *            @arg RCC_IT_PLLRDY: PLL ready interrupt flag
  *            @arg RCC_IT_HSI14RDY: HSI14 ready interrupt flag
  *            @arg RCC_IT_HSI48RDY: HSI48 ready interrupt flag (only applicable to STM32F0X2 USB devices)
  *            @arg RCC_IT_CSS: Clock Security System interrupt flag
  * @retval The new state of __IT__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_IT(__IT__) ((RCC->CIR & (__IT__)) == (__IT__))

